app/controllers/pages_controller.rb

SELECT "student_details".* FROM "student_details"
---
  def tc
   # Newsletter.weekly("soumitcse@zelo.in","sdfsdf" ).deliver;
  	 @student_list = StudentDetail.all

SELECT  "student_details".* FROM "student_details" WHERE "student_details"."id" = $1 LIMIT 1  [["id", 1]]
---
  def viewtc
  	# byebug
  	 @student_list = StudentDetail.find(params[:id])