app/controllers/student_details_controller.rb

  def index
    @student_details = StudentDetail.all
---
SELECT "student_details".* FROM "student_details"

  def show
     @student_details = StudentDetail.find(params[:id])
---
SELECT  "student_details".* FROM "student_details" WHERE "student_details"."id" = $1 LIMIT 1  [["id", 1]]

  def create
     # byebug

    @student_detail = StudentDetail.new(student_details_params)
    if params[:image_id].present?
      preloaded = Cloudinary::PreloadedFile.new(params[:image_id])
      raise "Invalid upload signature" if !preloaded.valid?
      @student_detail.image_id = preloaded.identifier
      end


    # @student_detail = StudentDetail.new(student_detail_params)

    respond_to do |format|
      if @student_detail.save
---
INSERT INTO "student_details" ("regno", "name", "image_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["regno", "sehfali"], ["name", "shefali"], ["image_id", "v1456076958/kk4nn4x7xvzye2t7ug5m.png"], ["created_at", "2016-02-21 17:49:24.951870"], ["updated_at", "2016-02-21 17:49:24.951870"]]

  def destroy
    @student_detail.destroy
---
DELETE FROM "student_details" WHERE "student_details"."id" = $1  [["id", 1]]

    def set_student_detail
      @student_detail = StudentDetail.find(params[:id])
---
SELECT  "student_details".* FROM "student_details" WHERE "student_details"."id" = $1 LIMIT 1  [["id", 1]]