app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "shefali"], ["password_digest", "$2a$10$ifiCOwGA5Mm7GpKvSJ8YpuwVnD4tTgbM1iii0rgQqcUTFE6aM47kW"], ["created_at", "2016-02-21 17:48:25.946245"], ["updated_at", "2016-02-21 17:48:25.946245"]]